knieriem/tinygo-stm32-svd/svd/stm32h757cm4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>Embedded Flash Memory</description>
      <groupName>FLASH</groupName>
      <baseAddress>0x52002000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ACR</name>
          <description>FLASH access control register</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0x00000037</resetValue>
          <fields>
            <field>
              <name>WRHIGHFREQ</name>
              <description>Flash signal delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>LATENCY</name>
              <description>Read latency</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x100</dimIncrement>
          <dimIndex>1-2</dimIndex>
          <name>BANK%s</name>
          <description>Cluster BANK%s, containing KEYR?, CR?, SR?, CCR?, PRAR_CUR?, PRAR_PRG?, SCAR_CUR?, SCAR_PRG?, WPSN_CUR?R, WPSN_PRG?R, CRCCR?, CRCSADD?R, CRCEADD?R, ECC_FA?R</description>
          <addressOffset>0x4</addressOffset>
          <register>
            <name>KEYR</name>
            <description>FLASH key register for bank 1</description>
            <addressOffset>0x0</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>KEY1R</name>
                <description>Bank access configuration unlock key</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CR</name>
            <description>FLASH control register for bank 1</description>
            <addressOffset>0x8</addressOffset>
            <resetValue>0x00000031</resetValue>
            <fields>
              <field>
                <name>CRCRDERRIE</name>
                <description>Bank 1 CRC read error interrupt enable bit</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CRCENDIE</name>
                <description>Bank 1 CRC end of calculation interrupt enable bit</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DBECCERRIE</name>
                <description>Bank 1 ECC double detection error interrupt enable bit</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SNECCERRIE</name>
                <description>Bank 1 ECC single correction error interrupt enable bit</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>RDSERRIE</name>
                <description>Bank 1 secure error interrupt enable bit</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>RDPERRIE</name>
                <description>Bank 1 read protection error interrupt enable bit</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>OPERRIE</name>
                <description>Bank 1 write</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>INCERRIE</name>
                <description>Bank 1 inconsistency error interrupt enable bit</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>STRBERRIE</name>
                <description>Bank 1 strobe error interrupt enable bit</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>PGSERRIE</name>
                <description>Bank 1 programming sequence error interrupt enable bit</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>WRPERRIE</name>
                <description>Bank 1 write protection error interrupt enable bit</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>EOPIE</name>
                <description>Bank 1 end-of-program interrupt control bit</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CRC_EN</name>
                <description>Bank 1 CRC control bit</description>
                <bitOffset>15</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SNB</name>
                <description>Bank 1 sector erase selection number</description>
                <bitOffset>8</bitOffset>
                <bitWidth>3</bitWidth>
              </field>
              <field>
                <name>START</name>
                <description>Bank 1 erase start control bit</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>FW</name>
                <description>Bank 1 write forcing control bit</description>
                <bitOffset>6</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>PSIZE</name>
                <description>Bank 1 program size</description>
                <bitOffset>4</bitOffset>
                <bitWidth>2</bitWidth>
              </field>
              <field>
                <name>BER</name>
                <description>Bank 1 erase request</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SER</name>
                <description>Bank 1 sector erase request</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>PG</name>
                <description>Bank 1 internal buffer control bit</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>LOCK</name>
                <description>Bank 1 configuration lock bit</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>SR</name>
            <description>FLASH status register for bank 1</description>
            <addressOffset>0xC</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CRCRDERR</name>
                <description>Bank 1 CRC read error flag</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CRCEND</name>
                <description>Bank 1 CRC end of calculation flag</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>DBECCERR</name>
                <description>Bank 1 ECC double detection error flag</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SNECCERR</name>
                <description>Bank 1 single correction error flag</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>RDSERR</name>
                <description>Bank 1 secure error flag</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>RDPERR</name>
                <description>Bank 1 read protection error flag</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>OPERR</name>
                <description>Bank 1 write</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>INCERR</name>
                <description>Bank 1 inconsistency error flag</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>STRBERR</name>
                <description>Bank 1 strobe error flag</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>PGSERR</name>
                <description>Bank 1 programming sequence error flag</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>WRPERR</name>
                <description>Bank 1 write protection error flag</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>EOP</name>
                <description>Bank 1 end-of-program flag</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CRC_BUSY</name>
                <description>Bank 1 CRC busy flag</description>
                <bitOffset>3</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>QW</name>
                <description>Bank 1 wait queue flag</description>
                <bitOffset>2</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>WBNE</name>
                <description>Bank 1 write buffer not empty flag</description>
                <bitOffset>1</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>BSY</name>
                <description>Bank 1 busy flag</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CCR</name>
            <description>FLASH clear control register for bank 1</description>
            <addressOffset>0x10</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CLR_CRCRDERR</name>
                <description>Bank 1 CRCRDERR1 flag clear bit</description>
                <bitOffset>28</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_CRCEND</name>
                <description>Bank 1 CRCEND1 flag clear bit</description>
                <bitOffset>27</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_DBECCERR</name>
                <description>Bank 1 DBECCERR1 flag clear bit</description>
                <bitOffset>26</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_SNECCERR</name>
                <description>Bank 1 SNECCERR1 flag clear bit</description>
                <bitOffset>25</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_RDSERR</name>
                <description>Bank 1 RDSERR1 flag clear bit</description>
                <bitOffset>24</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_RDPERR</name>
                <description>Bank 1 RDPERR1 flag clear bit</description>
                <bitOffset>23</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_OPERR</name>
                <description>Bank 1 OPERR1 flag clear bit</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_INCERR</name>
                <description>Bank 1 INCERR1 flag clear bit</description>
                <bitOffset>21</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_STRBERR</name>
                <description>Bank 1 STRBERR1 flag clear bit</description>
                <bitOffset>19</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_PGSERR</name>
                <description>Bank 1 PGSERR1 flag clear bit</description>
                <bitOffset>18</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_WRPERR</name>
                <description>Bank 1 WRPERR1 flag clear bit</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLR_EOP</name>
                <description>Bank 1 EOP1 flag clear bit</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>PRAR_CUR</name>
            <description>FLASH protection address for bank 1</description>
            <addressOffset>0x24</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMEP</name>
                <description>Bank 1 PCROP protected erase enable option status bit</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>PROT_AREA_END</name>
                <description>Bank 1 PCROP area end status bits</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
              <field>
                <name>PROT_AREA_START</name>
                <description>Bank 1 PCROP area start status bits</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>PRAR_PRG</name>
            <description>FLASH protection address for bank 1</description>
            <addressOffset>0x28</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMEP</name>
                <description>Bank 1 PCROP protected erase enable option configuration bit</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>PROT_AREA_END</name>
                <description>Bank 1 PCROP area end configuration bits</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
              <field>
                <name>PROT_AREA_START</name>
                <description>Bank 1 PCROP area start configuration bits</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>SCAR_CUR</name>
            <description>FLASH secure address for bank 1</description>
            <addressOffset>0x2C</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMES</name>
                <description>Bank 1 secure access protected erase enable option status bit</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SEC_AREA_END</name>
                <description>Bank 1 secure-only area end status bits</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
              <field>
                <name>SEC_AREA_START</name>
                <description>Bank 1 secure-only area start status bits</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>SCAR_PRG</name>
            <description>FLASH secure address for bank 1</description>
            <addressOffset>0x30</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>DMES</name>
                <description>Bank 1 secure access protected erase enable option configuration bit</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>SEC_AREA_END</name>
                <description>Bank 1 secure-only area end configuration bits</description>
                <bitOffset>16</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
              <field>
                <name>SEC_AREA_START</name>
                <description>Bank 1 secure-only area start configuration bits</description>
                <bitOffset>0</bitOffset>
                <bitWidth>12</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>WPSN_CURR</name>
            <description>FLASH write sector protection for bank 1</description>
            <addressOffset>0x34</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>WRPSn</name>
                <description>Bank 1 sector write protection option status byte</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>WPSN_PRGR</name>
            <description>FLASH write sector protection for bank 1</description>
            <addressOffset>0x38</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>WRPSn</name>
                <description>Bank 1 sector write protection option status byte</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CRCCR</name>
            <description>FLASH CRC control register for bank 1</description>
            <addressOffset>0x4C</addressOffset>
            <resetValue>0x001C0000</resetValue>
            <fields>
              <field>
                <name>ALL_BANK</name>
                <description>Bank 1 CRC select bit</description>
                <bitOffset>22</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CRC_BURST</name>
                <description>Bank 1 CRC burst size</description>
                <bitOffset>20</bitOffset>
                <bitWidth>2</bitWidth>
              </field>
              <field>
                <name>CLEAN_CRC</name>
                <description>Bank 1 CRC clear bit</description>
                <bitOffset>17</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>START_CRC</name>
                <description>Bank 1 CRC start bit</description>
                <bitOffset>16</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CLEAN_SECT</name>
                <description>Bank 1 CRC sector list clear bit</description>
                <bitOffset>10</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>ADD_SECT</name>
                <description>Bank 1 CRC sector select bit</description>
                <bitOffset>9</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CRC_BY_SECT</name>
                <description>Bank 1 CRC sector mode select bit</description>
                <bitOffset>8</bitOffset>
                <bitWidth>1</bitWidth>
              </field>
              <field>
                <name>CRC_SECT</name>
                <description>Bank 1 CRC sector number</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CRCSADDR</name>
            <description>FLASH CRC start address register for bank 1</description>
            <addressOffset>0x50</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CRC_START_ADDR</name>
                <description>CRC start address on bank 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>18</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>CRCEADDR</name>
            <description>FLASH CRC end address register for bank 1</description>
            <addressOffset>0x54</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CRC_END_ADDR</name>
                <description>CRC end address on bank 1</description>
                <bitOffset>2</bitOffset>
                <bitWidth>18</bitWidth>
              </field>
            </fields>
          </register>
          <register>
            <name>FAR</name>
            <description>FLASH ECC fail address for bank 1</description>
            <addressOffset>0x5C</addressOffset>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FAIL_ECC_ADDR</name>
                <description>Bank 1 ECC error address</description>
                <bitOffset>0</bitOffset>
                <bitWidth>15</bitWidth>
              </field>
            </fields>
          </register>
        </cluster>
