knieriem/tinygo-stm32-svd/svd/stm32h757cm4.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>HRTIM_TIMA</name>
      <description>High Resolution Timer: TIMA</description>
      <groupName>HRTIM</groupName>
      <baseAddress>0x40017480</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HRTIM1_MST</name>
        <description>HRTIM1 master timer interrupt</description>
        <value>103</value>
      </interrupt>
      <interrupt>
        <name>HRTIM1_FLT</name>
        <description>HRTIM1 fault interrupt</description>
        <value>109</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>ACR</displayName>
          <description>Timerx Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UPDGAT</name>
              <description>Update Gating</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>UPDGAT</name>
                <enumeratedValue>
                  <name>Independent</name>
                  <description>Update occurs independently from the DMA burst transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMABurst</name>
                  <description>Update occurs when the DMA burst transfer is completed</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMABurst_Update</name>
                  <description>Update occurs on the update event following DMA burst transfer completion</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Input1</name>
                  <description>Update occurs on a rising edge of HRTIM update enable input 1</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Input2</name>
                  <description>Update occurs on a rising edge of HRTIM update enable input 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Input3</name>
                  <description>Update occurs on a rising edge of HRTIM update enable input 3</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Input1_Update</name>
                  <description>Update occurs on the update event following a rising edge of HRTIM update enable input 1</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Input2_Update</name>
                  <description>Update occurs on the update event following a rising edge of HRTIM update enable input 2</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Input3_Update</name>
                  <description>Update occurs on the update event following a rising edge of HRTIM update enable input 3</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="HRTIM_Master.CR.PREEN">
              <name>PREEN</name>
              <description>Preload enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.DACSYNC">
              <name>DACSYNC</name>
              <description>AC Synchronization</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>MSTU</name>
              <description>Master Timer update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSTU</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Update by master timer disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Update by master timer enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBU</name>
              <description>TBU</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TBU</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Update by timer x disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Update by timer x enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEU</name>
              <description>TEU</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBU"/>
            </field>
            <field>
              <name>TDU</name>
              <description>TDU</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBU"/>
            </field>
            <field>
              <name>TCU</name>
              <description>TCU</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBU"/>
            </field>
            <field>
              <name>TRSTU</name>
              <description>Timerx reset update</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TRSTU</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Update by timer x reset/roll-over disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Update by timer x reset/roll-over enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TREPU</name>
              <description>Timer x Repetition update</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TREPU</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Update by timer x repetition disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Update by timer x repetition enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DELCMP4</name>
              <description>Delayed CMP4 mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DELCMP4</name>
                <enumeratedValue>
                  <name>Standard</name>
                  <description>CMP4 register is always active (standard compare mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Capture2</name>
                  <description>CMP4 is recomputed and is active following a capture 2 event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Capture2_Compare1</name>
                  <description>CMP4 is recomputed and is active following a capture 2 event or a Compare 1 match</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Capture_Compare3</name>
                  <description>CMP4 is recomputed and is active following a capture event or a Compare 3 match</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DELCMP2</name>
              <description>Delayed CMP2 mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DELCMP2</name>
                <enumeratedValue>
                  <name>Standard</name>
                  <description>CMP2 register is always active (standard compare mode)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Capture1</name>
                  <description>CMP2 is recomputed and is active following a capture 1 event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Capture1_Compare1</name>
                  <description>CMP2 is recomputed and is active following a capture 1 event or a Compare 1 match</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Capture1_Compare3</name>
                  <description>CMP2 is recomputed and is active following a capture 1 event or a Compare 3 match</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="HRTIM_Master.CR.SYNCSTRT">
              <name>SYNCSTRT</name>
              <description>Synchronization Starts Timer
              x</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.SYNCRST">
              <name>SYNCRST</name>
              <description>Synchronization Resets Timer
              x</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PSHPLL</name>
              <description>Push-Pull mode enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PSHPLL</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Push-pull mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Push-pull mode enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="HRTIM_Master.CR.HALF">
              <name>HALF</name>
              <description>Half mode enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.RETRIG">
              <name>RETRIG</name>
              <description>Re-triggerable mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.CONT">
              <name>CONT</name>
              <description>Continuous mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.CKPSC">
              <name>CKPSC</name>
              <description>HRTIM Timer x Clock
              prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <displayName>AISR</displayName>
          <description>Timerx Interrupt Status
          Register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>O1STAT</name>
              <description>Output 1 State</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>O1STAT</name>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Output was inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Output was active</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>O2STAT</name>
              <description>Output 2 State</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="O1STAT"/>
            </field>
            <field>
              <name>IPPSTAT</name>
              <description>Idle Push Pull Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>IPPSTAT</name>
                <enumeratedValue>
                  <name>Output1Active</name>
                  <description>Protection occurred when the output 1 was active and output 2 forced inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output2Active</name>
                  <description>Protection occurred when the output 2 was active and output 1 forced inactive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPPSTAT</name>
              <description>Current Push Pull Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPPSTAT</name>
                <enumeratedValue>
                  <name>Output1Active</name>
                  <description>Signal applied on output 1 and output 2 forced inactive</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Output2Active</name>
                  <description>Signal applied on output 2 and output 1 forced inactive</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DLYPRT</name>
              <description>Delayed Protection Flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DLYPRT</name>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Not in delayed idle or balanced idle mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Delayed idle or balanced idle mode entry</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST</name>
              <description>Reset Interrupt Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RST</name>
                <enumeratedValue>
                  <name>NoEvent</name>
                  <description>No TIMx counter reset/roll-over interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event</name>
                  <description>TIMx counter reset/roll-over interrupt occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST1</name>
              <description>Output 1 Reset Interrupt
              Flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>RST1</name>
                <enumeratedValue>
                  <name>NoEvent</name>
                  <description>No Tx output reset interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Tx output reset interrupt occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST2</name>
              <description>Output 2 Reset Interrupt
              Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="RST1"/>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x2</dimIncrement>
              <dimIndex>1-2</dimIndex>
              <name>SET%s</name>
              <description>Output %s Set Interrupt
              Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SET1</name>
                <enumeratedValue>
                  <name>NoEvent</name>
                  <description>No Tx output set interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Tx output set interrupt occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <dim>2</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-2</dimIndex>
              <name>CPT%s</name>
              <description>Capture%s Interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CPT1</name>
                <enumeratedValue>
                  <name>NoEvent</name>
                  <description>No timer x capture reset interrupt occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Event</name>
                  <description>Timer x capture reset interrupt occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field derivedFrom="HRTIM_Master.ISR.UPD">
              <name>UPD</name>
              <description>Update Interrupt Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.ISR.REP">
              <name>REP</name>
              <description>Repetition Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.ISR.CMP%s">
              <dim>4</dim>
              <dimIncrement>0x1</dimIncrement>
              <dimIndex>1-4</dimIndex>
              <name>CMP%s</name>
              <description>Compare %s Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
