knieriem/tinygo-stm32-svd/svd/stm32h757cm4.svd
        <register derivedFrom="CPT1CR">
          <name>CPT2CR</name>
          <displayName>CPT2BCR</displayName>
          <description>CPT2xCR</description>
          <addressOffset>0x60</addressOffset>
        </register>
        <register derivedFrom="HRTIM_TIMA.OUTR">
          <name>OUTR</name>
          <displayName>OUTBR</displayName>
          <description>Timerx Output Register</description>
          <addressOffset>0x64</addressOffset>
        </register>
        <register derivedFrom="HRTIM_TIMA.FLTR">
          <name>FLTR</name>
          <displayName>FLTBR</displayName>
          <description>Timerx Fault Register</description>
          <addressOffset>0x68</addressOffset>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HRTIM_TIMC</name>
      <description>High Resolution Timer: TIMC</description>
      <groupName>HRTIM</groupName>
      <baseAddress>0x40017580</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HRTIM_TIMB</name>
        <description>HRTIM1 timer B interrupt</description>
        <value>105</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <displayName>CCR</displayName>
          <description>Timerx Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field derivedFrom="HRTIM_TIMA.CR.UPDGAT">
              <name>UPDGAT</name>
              <description>Update Gating</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.PREEN">
              <name>PREEN</name>
              <description>Preload enable</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.DACSYNC">
              <name>DACSYNC</name>
              <description>AC Synchronization</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.CR.MSTU">
              <name>MSTU</name>
              <description>Master Timer update</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TBU</name>
              <description>TBU</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TBU</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Update by timer x disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Update by timer x enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEU</name>
              <description>TEU</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBU"/>
            </field>
            <field>
              <name>TDU</name>
              <description>TDU</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBU"/>
            </field>
            <field>
              <name>TCU</name>
              <description>TCU</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues derivedFrom="TBU"/>
            </field>
            <field derivedFrom="HRTIM_TIMA.CR.TRSTU">
              <name>TRSTU</name>
              <description>Timerx reset update</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.CR.TREPU">
              <name>TREPU</name>
              <description>Timer x Repetition update</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.CR.DELCMP4">
              <name>DELCMP4</name>
              <description>Delayed CMP4 mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.CR.DELCMP2">
              <name>DELCMP2</name>
              <description>Delayed CMP2 mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.SYNCSTRT">
              <name>SYNCSTRT</name>
              <description>Synchronization Starts Timer
              x</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.SYNCRST">
              <name>SYNCRST</name>
              <description>Synchronization Resets Timer
              x</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_TIMA.CR.PSHPLL">
              <name>PSHPLL</name>
              <description>Push-Pull mode enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.HALF">
              <name>HALF</name>
              <description>Half mode enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.RETRIG">
              <name>RETRIG</name>
              <description>Re-triggerable mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.CONT">
              <name>CONT</name>
              <description>Continuous mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field derivedFrom="HRTIM_Master.CR.CKPSC">
              <name>CKPSC</name>
              <description>HRTIM Timer x Clock
              prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register derivedFrom="HRTIM_TIMA.ISR">
          <name>ISR</name>
          <displayName>CISR</displayName>
          <description>Timerx Interrupt Status
          Register</description>
          <addressOffset>0x4</addressOffset>
        </register>
